/* The title of the button for aborting the scanning of Audio Units. */
"Abort" = "Prerušiť";

/* alert button
   dialog confirmation */
"OK" = "Potvrdiť";

/* alert button */
"Abort scan" = "Prerušiť skenovanie";

/* alert button */
"Continue" = "Pokračovať";

/* alert button */
"Continue scan" = "Pokračovať v skenovaní";

/* alert button */
"Ignore" = "Ignorovať";

/* alert button */
"Ignore plug-in" = "Ignorovať plugin";

/* alert button */
"Open plug-in graphic interface" = "Otvoriť grafické rozhranie pluginu";

/* alert button */
"Start Plug-In Manager" = "Spustiť Správcu pluginov";

/* alert text */
"Dear ^P user,\nyou have %ld Audio Unit(s) enabled which did not pass the Apple AU validation. This may cause problems and can even crash ^P or lead to data loss! Please check with the manufacturer(s) for updated versions. We recommend disabling these plug-ins in the Plug-In Manager." = "Milý užívateľ aplikácie ^P,\nmáte audiojednotky (%ld), ktoré neprešli overovaním Apple AU. Môže to spôsobiť problémy a dokonca aj pád aplikácie ^P, prípadne stratu dát! Kontaktujte výrobcu kvôli aktualizovaným verziám. Odporúčame zakázať tieto pluginy v Správcovi pluginov.";

/* alert text */
"Only Audio Units that have been successfully scanned will be available in ^P.\nScanning will continue next time you launch ^P." = "Pre aplikáciu ^P budú dostupné len úspešne oskenované audiojednotky.\nSkenovanie bude pokračovať pri najbližšom spustení aplikácie ^P.";

/* alert text */
"The Audio Unit “%@” by “%@” reports that it is not properly authorized to be used on this system.\nPlease check the plug-in’s documentation for more information about its copy protection." = "Audiojednotka „%1$@“ od výrobcu „%2$@“ hlási, že nie je správne autorizovaná na použitie v tomto systéme.\nInformácie o ochrane plug-inu pred kopírovaním nájdete v jeho dokumentácii.";

/* alert text */
"The Audio Unit “%@” by “%@” reports that it is not properly authorized to be used on this system.\nPlease check the plug-in’s documentation for more information about its copy protection. You may open the plug-in’s graphic interface now for managing copy protection." = "Audiojednotka „%1$@“ od výrobcu „%2$@“ hlási, že nie je správne autorizovaná na použitie v tomto systéme.\nInformácie o ochrane plug-inu pred kopírovaním nájdete v jeho dokumentácii. Pre spravovanie ochrany pred kopírovaním môžete otvoriť grafické rozhranie plug-inu.";

/* alert text */
"While verifying Audio Unit compatibility, ^P encountered %ld Audio Unit plug-in(s) which did not pass the Apple AU validation. These plug-ins have been excluded from further usage in ^P to prevent possible problems or crashes. You can start the Plug-In Manager now to review the validation results or continue the startup process." = "Počas overovania kompatibility audiojednotiek zaznamenala aplikácia ^P pluginy audiojednotiek (%ld), ktoré neprešli overovaním Apple AU. Tieto pluginy boli kvôli zabráneniu možných problémov a pádov vylúčené z ďalšieho používania v aplikácii ^P. Na kontrolu výsledkov overovania alebo pokračovanie v spustených procesoch môžete spustiť Správcu pluginov.";

/* alert text */
"^P unexpectedly quit while trying to use the Audio Unit “%@” by “%@”.\nThis plug-in may require an update." = "Aplikácia ^P bola počas pokusu o použitie audiojednotky „%1$@“ od výrobcu „%2$@“ neočakávane ukončená.\nTento plug-in je zrejme potrebné aktualizovať.";

/* alert title */
"An error has occurred with an installed Audio Unit plug-in." = "Vyskytla sa chyba v nainštalovanom plugine audiojednotky.";

/* alert title */
"Audio Unit authorization error." = "Chyba autorizácie audiojednotky.";

/* alert title */
"Incompatible Audio Units found." = "Našli sa nekompatibilné audiojednotky.";

/* alert title */
"You are about to abort the scan process." = "Chystáte sa prerušiť proces skenovania.";

/* alert title */
"You are using incompatible Audio Units." = "Používate nekompatibilné audiojednotky.";

/* audio unit type */
"MIDI processor" = "MIDI procesor";

/* audio unit type */
"MIDI-controlled effect" = "efekt ovládaný MIDI";

/* audio unit type */
"effect" = "efekt";

/* audio unit type */
"format converter" = "konvertor formátu";

/* audio unit type */
"generator" = "generátor";

/* audio unit type */
"instrument" = "nástroj";

/* audio unit type */
"mixer" = "mixpult";

/* audio unit type */
"offline effect" = "offline efekt";

/* audio unit type */
"output unit" = "jednotka výstupu";

/* audio unit type */
"panner" = "zmena panorámy";

/* message while starting up */
"Searching for Audio Unit plug-ins…" = "Hľadám pluginy audiojednotiek…";

/* message while starting up */
"Updating information about Audio Unit plug-ins…" = "Aktualizujem informácie o pluginoch audiojednotiek…";

/* possible validation result */
"couldn’t be opened" = "nepodarilo sa otvoriť";

/* possible validation result */
"crashed validation" = "overovanie spadlo";

/* possible validation result */
"failed validation" = "overovanie zlyhalo";

/* possible validation result */
"not authorized" = "neautorizované";

/* possible validation result */
"not validated due to internal error" = "neoverené kvôli internej chybe";

/* possible validation result */
"not yet validated" = "zatiaľ neoverené";

/* possible validation result */
"successfully validated" = "úspešne overené";

/* progress dialog text */
"Scanning Audio Units (finalized %d of %d)" = "Skenujem audiojednotky (dokončené %1$d z %2$d)";

/* progress dialog text */
"Scanning Audio Units (finalized %ld of %ld)" = "Skenujem audiojednotky (dokončené %1$ld z %2$ld)";

/* used for invalid version numbers */
"invalid" = "neplatné";

/* used when value transformer can’t interpret given object */
"unknown" = "neznáme";
